#
#██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗  ██╗░░░██╗░█████╗░░░░░░███╗░░
#██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║  ██║░░░██║██╔══██╗░░░░████║░░
#╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║  ╚██╗░██╔╝██║░░██║░░░██╔██║░░
#░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║  ░╚████╔╝░██║░░██║░░░╚═╝██║░░
#░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║  ░░╚██╔╝░░╚█████╔╝██╗███████╗
#░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝  ░░░╚═╝░░░░╚════╝░╚═╝╚══════╝


TOKEN = 'MTI1ODAwODkxNzQ2NDcxMTE3OQ.GD6twi.9djG0cSNdjJ8jwaujaXf5bKGIEBaY6ywV5jR5Y'

# КАРТИНКИ!!!

IMAGE = "https://media.discordapp.net/attachments/1107728800361496659/1131164219258187826/info.png" # автор изображение
Q_IMAGE = "https://emojiguide.org/images/emoji/8/42i2qsgsfqz8.png" # если у человека нету аватарки

# НЕ ТРОГАТЬ
DATABASE = "main.db"



######### НАБОРЫЫЫЫЫЫЫЫЫЫЫЫЫЫ

# КАРТИНКИ

BACK_IMG = "" # ссылка на изображение при подачи # in v0.2
NABOR_ICON = "https://i.imgur.com/rXYZiUX.jpeg" # ссылка на картинку в наборах 

# КАНАЛЫ

GUILD_ID = 1258009098125971601
NABOR_CHANNEL = 1284714166199910480
GUARD_CHANNEL = 1258753754665320472

CLAN_NABOR = 1283480313720471552
FAMILY_NABOR = 1283480375020228659

TEXT = """
     Хотите попасть в наш большой и дружный коллектив?
     Рассмотрите должности нашего стаффа, нажав на кнопку ниже, 
     и выберите ту, которая заинтересует вас.
    """

BLACK_LIST_ROLE = [1283486401777635502]

# РОЛИ

famid = 1283418480988655728
clnid = 1283486401777635502
verify_role = 1259342575924412506
noverify_role = 1258754004284870726

# ЭМОДЗИ ID

EMO = "<:blackdot:1283476967215071242>"

# ВОПРОСЫ 

Q1 = "имя/нейм, возраст"
O1 = "гена 12"

Q2 = "чё ты умеешь"
O2 = "докс сват звукарь славы марлоу"

Q3 = "пол гендер кем ты ся чувствуешь"
O3 = "мужчина женщина пидор лесбиянка трактор похуй, мы люди цевилизованные гасим токо пидоров"